Enums/ДополнительныеРеквизитыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДополнительныеРеквизитыНоменклатуры</Name>
			<Comment>Список возможных дополнительных реквизитов для номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МинимальныйОстаток</Name>
					<Comment>Минимальный остаток товара на складе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормаПотерь</Name>
					<Comment>Норма потерь товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальныйЗапас</Name>
					<Comment>Количество больше которого нет смысла заказывать товар у поставщика</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтходов</Name>
					<Comment>Процент отходов (для заполнения документа "списание")</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвантПоставки</Name>
					<Comment>Кратность формирования заказов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДополнительныеРеквизитыНоменклатуры/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();	
	ДанныеВыбора.Добавить(Перечисления.ДополнительныеРеквизитыНоменклатуры.МинимальныйОстаток);
	ДанныеВыбора.Добавить(Перечисления.ДополнительныеРеквизитыНоменклатуры.НормаПотерь);
	ДанныеВыбора.Добавить(Перечисления.ДополнительныеРеквизитыНоменклатуры.МаксимальныйЗапас);
	ДанныеВыбора.Добавить(Перечисления.ДополнительныеРеквизитыНоменклатуры.ПроцентОтходов);
	
КонецПроцедуры

#КонецОбласти
